<script lang="ts">
    let prikazni:{name:String, content:String, param:String}[] =
    [
        {name: "Бричење срамни влакна: Вториот најдобар начин!", content:"Најефективен начин за да ги избричете влакната насекаде по телото: лице, раце, нозе, препони, итн – е со мазен брич штотуку наострен на берберски каиш.", param:"prikazna1"},
        {name: "Како да доведете жена до незаборавен оргазам?", content:"Оваа статија е посветена на мажите кои се со отворен ум, а се во класата на оние кои сакаат да дознаат како да задржат една жена во фаза на оргазам во времетраење од пет до шест часа.", param:"prikazna2"},
        {name: "Водич за одличен секс на плажа", content:"Овој водич за одличен секс на плажа не е за егзибиционисти, ниту пак за оние со слабо срце. Не е ни за нудисти, зошто нудистите најчесто ја поврзуваат голотијата со сексот.", param:"prikazna3"},
        {name: "Како да имате добар анален секс?", content:"Аналниот секс е последното табу по кое многу жени копнеат. Покрај предупредувањата што следат, аналниот секс може да биде интересен, забавен, да доживеете интензивни чувства, доколку направите се како што треба.", param:"prikazna4"},
        {name: "Како да изразите почит кон својот маж?", content:"Ги сакам мажите. Начинот на кој се движат, нивната сигурност, начинот на кој со своите очи ги проверуваат параметрите на секој нов простор во кој влегуваат. Го сакам нивниот заштитнички став кон помалите и поранливите од нив.", param:"prikazna5"},
        {name: "Како да мастурбирате дома?", content:"Како да мастурбирате дома ? Значи, сакате да го пронајдете најдобриот начин за да имате секс, но проблемот е што не  живеете сами т.е. живеете со некој друг, на пример со вашите родители ( да некои и на триесет годишна возраст сеуште живеат со своите родители ), или сте на колеџ и живеете со цимер, или имате цимер по крвно сродство (брат/сестра ).", param:"prikazna6"},
    ]

    
</script>

<div class="w-full grid grid-cols-1 sm:grid-cols-2 gap-8 md:grid-cols-3">
    {#each prikazni as prikazna}
    <div class=" p-3 border flex flex-col border-white">
        <h2 class=" text-3xl">{prikazna.name}</h2>
        <p class=" mt-5">{prikazna.content}</p>
        <a class=" mt-auto text-[#f236be]" href={`prikazni/${prikazna.param}`}>Прочитај повеќе</a>
    </div>
    {/each}
</div>